[{ "subject":"First Full Infield Week!", "dateString":"August 11, 2015", "content":"It's been a great week! We tried to focus on contacts this week as me and elder Rodriguez are both not very good at that. Our goal was 35, 5 a day. We got 47! It was cool, but I'm still not a huge fan of talking to random people. Mostly I do the English contacts and elder Rodriguez does the Spanish, but we have done a fair amount of both, each.

  We found a few new investigators this week that are sweet! They all seem really prepared. One guy, Francisco, is the husband of a member who is a cool convert. They moved here not long ago, and he wants to start learning about the church! He's reading the BoM and taking in what we say. He's really cool. After just a couple lessons he told his boss he can't work Sunday's anymore so I think he's definitely going places. It might take a while though cause he wants to make sure he reads a lot and knows it's true and is committed, not just doing it for his wife. I get that. We will see what happens!

  Two ladies we just talked to on the street last night seemed super ready. They were way nice and we set up a return appointment this week. They seem like perfect candidateStrings for a plan of salvation lesson.

  Spanish is moving along! When the discussion is gospel centered I get a lot of it. It's just when a random person tells us a random story or I have no clue where the conversation is going that I get lost. I need context usually to really understand. I could tell one less active family was talking about me and laughing but I didn't understand it and I'm pretty sure that's why they were laughing haha

  We put someone on dateString for baptism! September 19, so kinda far off, but she needs some time. Haven't taught her much myself, but she seems way cool. Her name is Brenda.

  Today we went to the cardinals stadium and the mall there to buy some ties and stuff with our district. Then we watched some of their practice. There was a really cool lions hat at one store that I wanted to get just for the practice haha but it was expensive. It was fun! Pdays are super nice.

  All is well, and sounds like things are pretty good back home too! Have a great week everyone-Elder Clough"},{ "subject":"Hot and Dusty", "dateString":"August 17, 2015", "content":"It's been a great week! We tried to focus on contacts this week as me and elder Rodriguez are both not very good at that. Our goal was 35, 5 a day. We got 47! It was cool, but I'm still not a huge fan of talking to random people. Mostly I do the English contacts and elder Rodriguez does the Spanish, but we have done a fair amount of both, each.

  We found a few new investigators this week that are sweet! They all seem really prepared. One guy, Francisco, is the husband of a member who is a cool convert. They moved here not long ago, and he wants to start learning about the church! He's reading the BoM and taking in what we say. He's really cool. After just a couple lessons he told his boss he can't work Sunday's anymore so I think he's definitely going places. It might take a while though cause he wants to make sure he reads a lot and knows it's true and is committed, not just doing it for his wife. I get that. We will see what happens!

  Two ladies we just talked to on the street last night seemed super ready. They were way nice and we set up a return appointment this week. They seem like perfect candidateStrings for a plan of salvation lesson.

  Spanish is moving along! When the discussion is gospel centered I get a lot of it. It's just when a random person tells us a random story or I have no clue where the conversation is going that I get lost. I need context usually to really understand. I could tell one less active family was talking about me and laughing but I didn't understand it and I'm pretty sure that's why they were laughing haha

  We put someone on dateString for baptism! September 19, so kinda far off, but she needs some time. Haven't taught her much myself, but she seems way cool. Her name is Brenda.

  Today we went to the cardinals stadium and the mall there to buy some ties and stuff with our district. Then we watched some of their practice. There was a really cool lions hat at one store that I wanted to get just for the practice haha but it was expensive. It was fun! Pdays are super nice.

  All is well, and sounds like things are pretty good back home too! Have a great week everyone-Elder Clough"},{ "subject":"I got to drive!", "dateString":"August 24, 2015", "content":"Friday was kind of a crazy day! We had exchanges, so my trainer went to another area with our district leader for the day, and I stayed in our area and the district leaders companion joined me. So yeah a little stressful cause I'm new and had to lead the area... Plus the guy I was with doesn't know any Spanish.. So I was kinda freaking out a bit. Thought it was just gonna be a day of fake lessons where I say some stuff and then hope they understand cause I don't know what they are saying back haha. And we finally got some members to come out with us so that someone would know Spanish really well and be able to answer questions. But then that fell through! So I thought it was going to be a disaster. But at least I got to drive cause my companion wasn't there haha.. It was great! Missed driving so much. Just the Corolla, but it's better than nothing.

  We had district meeting Friday so that took up some time where we didn't need to be able to speak Spanish, but we had 4 lessons scheduled for after dinner and I was a little worried. Finally this awesome guy in our ward, Hermano Dominguez, got back to us and said he could come with us. Most of our lessons fell through that day so it didn't matter too much, but we did have one with a guy named Carlos, who is super solid and super interested. We taught a pretty good lesson. My comp for the day said nothing, hermano Dominguez said a bit. But the gift of tongues is totally real. I was already happy cause Carlos speaks super clearly and slowly compared to most people. Me and him were having a real conversation! Haha it was way cool. We talked about the first principles and ordinances and finally he committed to being baptized on the 19th of September! It was super cool! So it was a solid day, even though everything else fell through.

  He said he would come to church, but he ended up having to work so he couldn't, that was kind of a bummer. This week we had lots of good lessons, but we are still struggling to get people to come to church, so we really need to work on that. We didn't find anyone new this week, which isn't good, we have to make sure we keep finding even though we have lots of new people already.

  Nothing else exciting really happened. Good week though! Ready for another one

  -Elder Clough"},{ "subject":"Hot Week!", "dateString":"August 31, 2015", "content":"Another good week, of course! We've been biking all week since it's the end of the month and we don't have miles. I have a nice tan line from my watch now. Biking is fun, I like those days, other than how hot it is. I think in the next few months biking will be very nice. Everyone says there is a huge difference as soon as it changes from August to September here.

  The hottest day though was Saturday. Brenda, who is getting baptized this Saturday but in a different ward, had us over for dinner with her member brother and his family. Her brother Juan Carlos is pretty cool, and challenged me to eat some hot stuff. He said he was gonna get me a ghost pepper and habanero, and I was a little scared. He couldn't find those, so Saturday he just brought out some random pepper, don't know what kind, and prepped it for me. He rubbed it between his hands for a while and then heated it really good on the stove. He says doing that makes any pepper much hotter. It was pretty big too, but I had to eat it. My first bite was ok, but the second bite I breathed in too much and it burned my throat so badly. It was very hot. My eyes were watering but this guy was laughing at me a bunch so I couldn't let myself cry. I ate it all with lots of juice. Fun fact- Mexicans don't call anything juice. For orange juice, it actually translates into water of orange. They say agua de ________ for everything not juice. So if someone asks if you want water, it probably won't actually be water. At the mtc we kinda made fun of it and started called milk agua de vaca, which means water of cow. So we had agua de Jamaica, which is really good, but it didn't help the burn very much haha

  It's been a really good month! We hit all our goals for August, except we had wanted to get a baptism. We hope for one or two now in September, not counting Brenda. We had a lesson with a guy named Efrain Friday, and got him to accept a baptismal dateString too! He has been meeting with missionaries and going to church for forever. We planned to help him see why baptism was really important, but if he kept pushing us off we were just going to tell him we can't come by much any more. But he accepted it! He's so awesome. Crusty old guy. But he's going to try to be baptized October 10! I really hope he makes it.

  Other than that, pretty normal week. Had some good lessons, founding a few new investigators. They seem solid but we might need to refer them to ysa.... Bummer. But thats okay! As long as they learn about the gospel.

  Ready for another good week! Life in the real world sounds exciting!

  Love,Ben"},{ "subject":"Assistant District Leader Elder Clough", "dateString":"September 14, 2015", "content":"This week has been good! A little stressful, cause our area grew. We had sisters also in our Spanish ward. But they got moved, and no one came in. So now we cover the whole ward! Which covers the whole stake. We went from about 10 square miles to about 30. And we gained a lot of investigators and potentials from the sisters. It's a little crazy. We have a lot of miles though! They don't expect us to bike at all anymore because we cover such a huge area. And the Ward is kind of nervous now because they realize it's a lot for us to do, so it seems like they're gonna want to help us more! We always want to do splits but it's hard to find enough people, but now the bishop and the elders quorum president are more energetic about getting people to help us. So hopefully that keeps up! The mission has been shrinking, especially the amount of Spanish missionaries. So pretty much every ward just has one set now, where our ward for example had 3 sets a year ago. Kinda crazy. Sounds like the opposite is happening in the Detroit mission! It's been kind of tough to get going in the sisters' area. We don't have contact information or relationships with a lot of the people they were dealing with. Hopefully we will be able to handle it well! So far has been good. Lots of phone calls and text messages to tell people the sisters are gone haha.

  But we did receive some blessings from the new area! The sisters just had a baptism last Monday, and we confirmed them Sunday! We will be working with them now, and will probably baptize the ladies daughter soon. They're really cool so that should be fun. Also since all the investigators are ours now, we had 6 at church Sunday! 3 were our old area, 3 were the sisters old area. So still would've been a good Sunday, but it was really good! Haha the people are what's important, but numbers still are fun to have.

  I'm the assistant district leader now! That's not actually a thing... It actually just means my companion is the district leader. Should be good! He's a super good missionary.

  Nothing too exciting happened other than all that this week. Taught some lessons, visited some people, went to church! The usual. Looking forward to another good week!

  Love,Elder Clough "},{ "subject":"I want to buy a school bus", "dateString":"September 21, 2015", "content":"We had a great week! This was the first week we hit standards ofexcellence,which is a list of numbers our president has set thatdetermine sort of astandard of consistency. It's pretty tough to get,since we haven't hadbaptisms. But since we now cover the whole ward,the baptisms the sisters hadright before they left counted for us!I'd feel weird saying we hit standards,but we basically got a baptismwith Brenda earlier this month so it counts tome!

  One day on exchanges, I was in an English area with Elder Ockey fromourdistrict. He's way cool. Anyways we went to one persons house, andin thedriveway next door there was a school bus! This guy was outworking on it, sowe went and talked to him. He was super redneck.When he retired, he went andbought an old school bus and worked onthe interior. It's now a really coolcustom RV! He put flooring in,couches, and even rigged it with solar panelsfor the fridge and AC.Pretty awesome.

  Also last week, we had a missionvisitor. Elder Foster came and talkedto us, half the mission at a time. So wehad it Friday, and me andElder Rodriguez played! He played violin, and Iaccompanied him. Itwas a pretty simple arrangement of Nearer My God to Thee,but wedidn't practice much so I was really nervous. I think it wasokaythough! The mission tour was good, he talked about harvesting notjustplanting seeds. Members are supposed to plant and nourish, and we dotheharvesting. Members I guess get scared because they think theyhave toharvest.

  We had a cool experience with the Rodriguez family this week! Wehavebeen trying to find them, and have seen the kids a lot but theparentsare never home. So finally this week, we found the mom, and talkedtoher about mutual and Sunday services because she really wants her kidstobe around good influences. So they went to mutual last week finallyand lovedit! We were back in the area and saw the daughter who'sabout 10, and she ranup to us telling us how much she loved it! So wetold her to tell her mom that,and she said she did she is definitelygoing this Wednesday as well. Yes! Gotthe kids hooked! Now we justneed them hooked on Sunday's too!!

  So yeah, itwas a good week! Hope to keep it up! I'm going to attachone picture of us withthe elders from our apartments and the zoneleaders. We had breakfast with somerecent converts on Saturday andthey invited us all. That day we had 3 mealswith members! First timethat has happened.

  Love,Elder Clough"},{ "subject":"Almost Cooling off!", "dateString":"September 28, 2015", "content":"This week the work just kept moving along! It got a bit hotter again.It wasnicer, like in the low 90s, but this weekend and the beginningof this week isback to 100+. Still better, but summer is not quiteover yet! It just keepsholding on. It's nice being in a car ofcourse, but I do think it would be funto be on a bike. What mycompanion and I are planning (even though we don'thave much of a sayhaha) is that whenever we separate, probably this transferor afternext transfer, that we will both stay in our Ward and we willjustdivide it again. And I'll have our old area, the smaller one, and gobackto part time biking. And we will both have some new companions. Ithink thatwould be really good! But our mission needs to get moreSpanish speaking eldersand sisters.

  The coolest thing of this week started last week! Last Sunday,therewere two ladies at church that we had never seen before. We talkedtothem, and they weren't members! And they didn't really know anyone intheWard. So we were kinda confused about how they got there, but wewere totallyokay with it! So we got their information, and got overto their apartments toteach them. And it was a really good lesson! Weshowed because of him, which isan awesome video, and talked about ourlife here. It was pretty powerful allaround, and the one lady startedout just kinda there and ended prettyinterested! Her friend got herto join her, she has already talked tomissionaries a bit in Mesa, andjust moved here. So they both seem really cool!Hopefully we will beteaching them pretty regularly now.

  The bummer of theweek is that Efrain has been having some issues, sohis baptism won't be assoon as we had hoped. He still wants to bebaptized, and he wants to work onthis, but it won't be super soon.Kind of a bummer. There are a good amount ofpeople wanting to bebaptized that have to change some pretty major thingsbefore they can,it's tough cause there's no easy answer. We just gottamotivate themto change a little!

  Also the Rodriguez family seems to be onlyinterested in mutual. It'sa bummer, but still a good start. The kids are superenthusiastic sowe just need to make the parents catch it!

  Other than that,not much else! Looking forward to another great week!

  Oh and we went bowlingtoday! I did surprisingly well, bowled a 137then a 138! I'll attach a pictureof the zone too. It's shrunk a bit.

  Love,Elder Clough"}]