[{ "subject":"Two Weeks Down", "dateString":"July 2, 2015", "content":"It's been a busy week, of course.  We had finished teaching our first investigator, Claudia, and things were pretty good so I felt pretty secure aboutSpanish and at least being able to kinda teach people.  haha that was a joke.  We got new investigators, Luis and Susanna, and at the first lesson with Luis I was blown away.  Totally got destroyed.  I couldn't really understand anything he was saying it was so rough...  But he either slowed down on the following lessons or we got the gift of tongues cause it got waybetter on the following lessons.

  Today was cool!  We got the chance to go to the temple, even though it is closed.  We got to see it and go through the visitor center, it is all very nice.  The visitor center had this really cool exhibit where you moved around and there were different videos about families, it was super touching.  I spoke on Sunday in spanish, but even crazier things happened that day.  Iwalk into our chapel, and guess who is there!!  Brother Henry!  He got called into our branch presidency, but only was called a week ago.  It was crazy, I was so confused for a second.  I wasn't positive it was him at first, only knew that I recognized him and knew that I didn't expect him to be there.  Carson is going to byu this fall before going on a mission,and Tyler is in Russia.  It was cool to catch up, sounds like they really like mexico city too.

  My district is super funny, they keep things from bogging us down.  We do alot but we get along really well so its fun.  Not sure what else to say!  Every day is kinda just the same.. jam packed.  Spanish is getting better. I can listen better than I could after spanish 2 for sure, but I still don't quite have all the talking that I had in high school.  My vocabulary is very gospel based haha.. I can teach about the restoration but I can't really talk about my life at all or even ask for someone to hand mea napkin.

  Oh Katie got here yesterday!  Along with Logan Newman who was in my byu ward, we were pretty good friends.

  Love, Elder Clough "},{ "subject":"One Month!", "dateString":"July 16, 2015", "content":"It has been a good week!  Kinda long, but time is just really weird here.  An elder in my district said 'someone could tell me weve been here for 3 days and that would make sense.  someone could tell me we have been here for 3 years and that would make sense too.'  Pretty accurate.

  Spanish is going pretty well I think.  I think in english but pretty much after every thought i start to automatically translate it in my head to spanish, its really weird.  Kinda messes with my head haha.  My companion has been doing a lot better lately with spanish, so thats really good.  He was pretty down on himself before about struggling with it.  That has been better though so all is well.

  Our investigators are progressing I think.  We just kinda say stuff and hope we understand their responses correctly.  For the most part I get the gist but some people talk really fast so there could be little words that really change the meaning.  Oh well, just gotta try and do what I can.

  We all watched the live funeral services for President Packer on friday, that was really good.  Its cool to see apostles talking about each other so sincerely and just like normal good friends.  They are all powerful guys.

  We had another 70 this tuesday for devotional, Elder Salinas.  He was very enthusiastic.  They had someone translate him into spanish at the same time so sometimes he would jump ahead and start talking over the translater because he was just too excited haha.

  We sang the efy medley in the choir for that devotional, it was cool but I like the english version better haha.  Its a pretty big group so at the beginning of each devotional like half of us in the audience get up and move to the front haha.  Its different singing in spanish, but the hymn book has most of the songs I really like so thats good.

  Tanner, er Elder Seibold, just left tuesday!  He was excited.  I saw him a fair amount, but just really in passing never did any more than talk for a little.  He was the only one i know of going to his mission.  I only have my companion going to the same place.  It will be good to be back in the states I think, but this doesnt feel very mexico-ish since were just boxed in.  Looking at the hills to the sides is cool though cause houses go all the way up.  It would be a pain to travel through some parts of the city.

  Im excited to head out!  I dont really feel prepared, but people say you are pretty much useless for a little while cause you cant understand the language fast enough so i just want to get going kinda.  All is well!!

  Love,Elder Clough"},{ "subject":"Halfway Done with the CCM!", "dateString":"July 9, 2015", "content":"Hola!

  Right now were supposed to be speaking only spanish, but our teachers said we can write in english luckily.  If we do pretty good speaking only spanish yesterday, today, and tomorrow, then they are gonna get us pizza on saturday.  Its the little things.  Espanol is coming, but its tough to use it all day.  There are just so many random little things I have no clue how to say.  Lessons with our investigators are doing pretty well, but its hard to try and help people figure out why doing stuff is important in espanol.  Once a week we have TRC where we teach some native volunteers and that is very difficult.  I generally get the main idea of what they are saying but I dont pick up on any details haha.

  The 4th of July here was kinda fun!  Everyone from the states was wearing red white and blue, and some guys had 2 ties on to make sure they got the red and blue.  Then at lunch everyone stood up and randomly started singing the national anthem as we faced a flag that we put on top of the drink machine, it was super funny.

  I got a haircut today from the CCM barbershop, its free so I might get another one before I leave.  Its funny cause they dont speak much english there so you just sit down and they do the same thing for everyone.  Works for me!  Tuesday was my companions birthday, and he got a package and some letters.  People are getting letters, and that package, through some missionary mail service that is more reliable.  He was totally suprised to get a package, no one expected one of those haha.

  We have had a couple 70s here from the area for devotionals.  Elder Pieper and another guy I forget the name of.  Tomorrow we are having sort of a special devotional to watch the funeral for President Packer.  Elder Pieper said he has been presiding in the quorom of the 12 for 21 years!  That was so long.  Ive never seen someone else be the President of the 12.  Kinda crazy.  And now Elder Nelson seems in really good health, but he is still 90.  Most of the devotional this week with Elder Pieper was just about how grateful he is for Prophets that dedicate so much to us and lead us so well.  50+ years of service for some.  Its incredible.

  Ive started to read the Book of Mormon from the beginning in spanish as well as Jesus the Christ in english.  Im not sure which one is harder to understand!  But both my gospel knowledge and language skills are coming along I think.

  Thanks for the notes!-Elder Clough"},{ "subject":"Only 4 More Days Here!", "dateString":"July 23, 2015", "content":"This week has gone pretty fast.  We are all anxious to get into the field.  I am very excited to be in Phoenix, even though I am going to burn alive, be totally lost, and not understand spanish at all.  I hope I can sit next to a hispanic to try and speak spanish haha.  Some people are planning on converting the person they sit by, but I just want to understand a little and be able to talk.  Small goals.  Our flight leaves at 7 so we have to be ready to get onto the bus by 2:30 am.  So instead of talking or converting, most likely I will just be sleeping the whole time I travel.  I will be in Phoenix around 8:30 am!  Some other guys leaving with us are heading to Paraguay, so they have a much longer trip.  They fly to panama and then have a 5 hour layover, then get to Paraguay about 10 at night.  I definitely got a better travel schedule.

  Not too much different happened this week.  We sang Come thou Fount in spanish for an Elder Reyes on tuesday.  Continuing to learn spanish.  We had our last TRC (teaching volunteer members) this wednesday, and we did a lot better than we have in the other ones, so thats good.  Its just hard to get a conversation going, we basically only know how to teach lessons.  Thats what I hope to focus on for the next while, being more able to converse normally and understand normal conversation.  Its tough.  Hispanics think we talk really fast in english, but our english seems so much slower comparatively to the rate at which they talk.  And lots of people pronounce things differently from different areas.  I can understand my teachers pretty good now but it gets much harder when I have to talk to someone Im not familiar with.

  We had our last lesson altogether with our teacher Hermana Santiago yesterday.  Half our district leaves monday, and the next couple days are pretty full of field orientation stuff.  Monday will probably be very relaxed, we will just have 4 of us.  I might be singing as part of a quartet thing in our sacrament meeting this sunday, 2 guys 2 girls.  That should be cool, but Im nervous.  They have all been in choirs and stuff and im just the random guy that kinda likes singing and does like ward choirs haha.

  Im jealous that you are all up north!  The weather is super nice here, but Im sure that once im in Phoenix I will definitely be missing the lake.  I shouldve done a backflip on the wakeboard before I left.  Did I make a full 360 surfing and not need the rope to keep going before I left?  I cant remember... It seems so long ago... I feel like I did but it mightve been a dream, i dont know.

  Its been fun to talk to Katie!  I mean, Hermana Fuller.  I dont remember her much, so this was kind of a cool opportunity.  I have eaten meals with her a few times and chatted.  Also, Jon Schlitters friend from byu is here.  Today our district beat his district in basketball really bad, it was fun.  Haha we have a couple guys that are pretty good.  Im decent.  We also played with this group of really tall guys today and they were amazing.  They didnt even try.  They barely had to leave the ground to dunk.  I am kinda close to dunking, but not quite.  Im jealous haha.

  They just finished the new cafeteria!  They have been renovating it for a year, so we are lucky to be able to use it for our last little while.  Its glorious.  Its all open so I dont have to get up when my comp gets more food, or vice versa.

  Well thanks for all the notes!  Here are a couple pictures, one of our district with Hermana Santiago, and the other with Hermana Fuller.  We couldnt take a picture just us 2 so we grabbed a few random missionaries to be in it with us.  Its her companion, and then I have no clue who the other Elders are.

  All is well!-Elder Clough"}]