[
  {
    "subject":"El Fin Se Acerca",
    "dateString":"May 29, 2017",
    "content":"Well, this is my last missionary letter. For the last time, we had another great week! We were able to go back to my last ward (which is Elder Walkers last ward as well) for the baptism of a couple kids we had taught there! It was awesome. It was also elder walkers birthday, so that was a pretty good present. It was fun to see a few people I knew and say goodbye to them.\n\nThen yesterday we also had a baptism. Gloria was baptized by her grandfather. She came to the Gomez baptism about 5 weeks ago and has wanted to get baptized since then. She was super excited, and we had a really nice service for her. A good amount of people came, which was nice. It's always a little sad when baptisms have low attendance. The picture isn't the best, but I'll send it anyways.\n\nI had my last real district meeting. Apparently, a funeral is being planned for me this week haha. It's pretty crazy to think the mission is ending. This week I had a mission first! A while ago some ASL missionaries from the Scottsdale mission came to visit each zone and talked about what to do if we ran into deaf people. They gave us this video of them signing about what missionaries do so we could show it to people. On Sunday, a young girl brought her deaf friend to church. He couldn't understand things, but just enjoyed playing with the other kids. She's picked up some ASL just by being his friend. We went up and tried to communicate, failed, and showed him the video! He was excited so we contacted them and got them to drive over and teach him last night. Who knows if it will go anywhere, but it's cool to see the gospel in every single language.\n\nWell, the mission has been amazing. The things I've learned, the spirit I've felt, and most importantly the people I've met have made this time truly incredible. With everything I've had happen, I wouldn't regret it even if the church wasn't true. Which really just shows me even more that it is! But the people I've met have really been special. Luckily, I do also know this church is true. I know I've made more than my fair share of mistakes in these 2 years, but I also feel good about what I've done. I've strived to help people learn more about our Heavenly Father. One of my favorite ways to do that is through the Book of Mormon. I really love that book. I've seen its power to life in my life as well as the lives of so many members and non members I've taught. It's a bittersweet feeling to end. I can hardly remember the time before I left for Mexico, and yet it seems so hard to believe that two years are up. I'm so excited for the next part of life, and yet I know I will never get experiences of teaching quite like these again in my life. I truly love Arizona, and the people here. I wish I could bring my family and be released but just stay around the great people I've come to love so much.\n\nBut I know coming home is part of Gods plan, and I'm excited. And know He loves me, and every one of us, so it'll all work out just fine. I'll see you soon, and I am so grateful for the constant love and support I've be blessed to feel this whole time!\n\nCon mucho amor,\nBen"
  }
]